In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [5]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
df1=pd.DataFrame([[1,2,3,4,4,5],[2,34,45,56,7,4],[234,245,64,57,4,6],[24,43,53,64,65,4],[35,46,67,6,5,4],[2,53,46,56,57,7]])

In [9]:
df1

     0    1   2   3   4  5
0    1    2   3   4   4  5
1    2   34  45  56   7  4
2  234  245  64  57   4  6
3   24   43  53  64  65  4
4   35   46  67   6   5  4
5    2   53  46  56  57  7

In [10]:
df1.head()

     0    1   2   3   4  5
0    1    2   3   4   4  5
1    2   34  45  56   7  4
2  234  245  64  57   4  6
3   24   43  53  64  65  4
4   35   46  67   6   5  4

In [11]:
df1.head(3)

     0    1   2   3  4  5
0    1    2   3   4  4  5
1    2   34  45  56  7  4
2  234  245  64  57  4  6

In [12]:
df1.tail()

     0    1   2   3   4  5
1    2   34  45  56   7  4
2  234  245  64  57   4  6
3   24   43  53  64  65  4
4   35   46  67   6   5  4
5    2   53  46  56  57  7

In [13]:
df1.tail(2)

    0   1   2   3   4  5
4  35  46  67   6   5  4
5   2  53  46  56  57  7